#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.test.module.vpn-manage-internal.random_id.ipsec_secret: Refreshing state... [id=fUXC0wWuTHs]
module.test.module.vpn-manage-internal.google_compute_address.vpn_gw_ip: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/addresses/ip-cq-compute]
module.test.google_compute_target_http_proxy.gcp_compute_target_http_proxies: Refreshing state... [id=projects/cq-provider-gcp/global/targetHttpProxies/cq-target-http-proxy]
module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp4500: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp4500]
module.test.google_compute_router.vpn_router: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/routers/cq-us-east1-compute-vpn-router]
module.test.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/cq-provider-gcp/global/networks/cq-compute-vpc]
module.test.google_compute_backend_service.backend-service: Refreshing state... [id=projects/cq-provider-gcp/global/backendServices/cq-backend-service]
module.test.data.google_client_config.default: Reading...
module.test.google_compute_target_https_proxy.gcp_compute_target_https_proxies: Refreshing state... [id=projects/cq-provider-gcp/global/targetHttpsProxies/cq-target-https-proxy]
module.test.google_compute_backend_service.another-backend-service: Refreshing state... [id=projects/cq-provider-gcp/global/backendServices/cq-another-backend-service]
module.test.module.vpn-manage-internal.google_compute_vpn_gateway.vpn_gateway: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute]
module.test.data.google_client_config.default: Read complete after 0s [id=projects/cq-provider-gcp/regions/us-east1/zones/]
module.test.google_compute_instance_group.test: Refreshing state... [id=projects/cq-provider-gcp/zones/us-east1-b/instanceGroups/cq-instance-group]
module.test.google_compute_target_ssl_proxy.gcp_compute_target_ssl_proxies_proxy: Refreshing state... [id=projects/cq-provider-gcp/global/targetSslProxies/cq-target-ssl-proxy]
module.test.module.vpn-manage-internal.google_compute_route.route[0]: Refreshing state... [id=projects/cq-provider-gcp/global/routes/cq-compute-tunnel1-route1]
module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_esp: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-esp]
module.test.google_compute_ssl_policy.ssl-policy: Refreshing state... [id=projects/cq-provider-gcp/global/sslPolicies/cq-ssl-policy]
module.test.google_compute_url_map.external_url_map: Refreshing state... [id=projects/cq-provider-gcp/global/urlMaps/cq-external-urlmap]
module.test.google_compute_backend_service.internal-backend-service: Refreshing state... [id=projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service]
module.test.google_compute_url_map.url_map: Refreshing state... [id=projects/cq-provider-gcp/global/urlMaps/cq-urlmap]
module.test.google_compute_https_health_check.backend-service-health-check: Refreshing state... [id=projects/cq-provider-gcp/global/httpsHealthChecks/cq-health-check]
module.test.module.vpn-manage-internal.google_compute_vpn_tunnel.tunnel-static[0]: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/vpnTunnels/cq-compute-tunnel-1]
module.test.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-compute-subnet-01"]: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-compute-subnet-01]
module.test.google_compute_managed_ssl_certificate.gcp_compute_managed_ssl_certificates_cert: Refreshing state... [id=projects/cq-provider-gcp/global/sslCertificates/cq-managed-cert]
module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp500: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp500]
module.test.google_compute_instance.default: Refreshing state... [id=projects/cq-provider-gcp/zones/us-east1-b/instances/cq-compute]
module.test.module.gke.data.google_compute_zones.available: Reading...
module.test.module.gke.data.google_container_engine_versions.region: Reading...
module.test.module.gke.data.google_container_engine_versions.region: Read complete after 0s [id=2022-05-23 07:47:48.854858332 +0000 UTC]
module.test.module.gke.data.google_compute_zones.available: Read complete after 0s [id=projects/cq-provider-gcp/regions/us-east1]
module.test.module.gke.data.google_container_engine_versions.zone: Reading...
module.test.module.gke.data.google_container_engine_versions.zone: Read complete after 0s [id=2022-05-23 07:47:48.998078463 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.test.google_compute_backend_service.another-backend-service will be destroyed
  # (because google_compute_backend_service.another-backend-service is not in configuration)
  - resource "google_compute_backend_service" "another-backend-service" {
      - affinity_cookie_ttl_sec         = 0 -> null
      - connection_draining_timeout_sec = 300 -> null
      - creation_timestamp              = "2022-03-24T01:48:00.067-07:00" -> null
      - custom_request_headers          = [] -> null
      - custom_response_headers         = [] -> null
      - enable_cdn                      = false -> null
      - fingerprint                     = "fcJCSJZjNO8=" -> null
      - health_checks                   = [] -> null
      - id                              = "projects/cq-provider-gcp/global/backendServices/cq-another-backend-service" -> null
      - load_balancing_scheme           = "EXTERNAL" -> null
      - name                            = "cq-another-backend-service" -> null
      - port_name                       = "http" -> null
      - project                         = "cq-provider-gcp" -> null
      - protocol                        = "SSL" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-another-backend-service" -> null
      - session_affinity                = "NONE" -> null
      - timeout_sec                     = 30 -> null
    }

  # module.test.google_compute_backend_service.backend-service will be destroyed
  # (because google_compute_backend_service.backend-service is not in configuration)
  - resource "google_compute_backend_service" "backend-service" {
      - affinity_cookie_ttl_sec         = 0 -> null
      - connection_draining_timeout_sec = 300 -> null
      - creation_timestamp              = "2022-05-09T02:05:12.198-07:00" -> null
      - custom_request_headers          = [] -> null
      - custom_response_headers         = [] -> null
      - enable_cdn                      = false -> null
      - fingerprint                     = "2d5U4XTt9dQ=" -> null
      - health_checks                   = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/httpsHealthChecks/cq-health-check",
        ] -> null
      - id                              = "projects/cq-provider-gcp/global/backendServices/cq-backend-service" -> null
      - load_balancing_scheme           = "EXTERNAL" -> null
      - name                            = "cq-backend-service" -> null
      - port_name                       = "http" -> null
      - project                         = "cq-provider-gcp" -> null
      - protocol                        = "HTTPS" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-backend-service" -> null
      - session_affinity                = "NONE" -> null
      - timeout_sec                     = 30 -> null
    }

  # module.test.google_compute_backend_service.internal-backend-service will be destroyed
  # (because google_compute_backend_service.internal-backend-service is not in configuration)
  - resource "google_compute_backend_service" "internal-backend-service" {
      - affinity_cookie_ttl_sec         = 0 -> null
      - connection_draining_timeout_sec = 300 -> null
      - creation_timestamp              = "2022-03-24T01:48:00.353-07:00" -> null
      - custom_request_headers          = [] -> null
      - custom_response_headers         = [] -> null
      - enable_cdn                      = false -> null
      - fingerprint                     = "nSwgyfJSKGs=" -> null
      - health_checks                   = [] -> null
      - id                              = "projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
      - load_balancing_scheme           = "INTERNAL_SELF_MANAGED" -> null
      - name                            = "cq-internal-backend-service" -> null
      - port_name                       = "http" -> null
      - project                         = "cq-provider-gcp" -> null
      - protocol                        = "HTTP" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
      - session_affinity                = "NONE" -> null
      - timeout_sec                     = 30 -> null
    }

  # module.test.google_compute_https_health_check.backend-service-health-check will be destroyed
  # (because google_compute_https_health_check.backend-service-health-check is not in configuration)
  - resource "google_compute_https_health_check" "backend-service-health-check" {
      - check_interval_sec  = 60 -> null
      - creation_timestamp  = "2022-05-09T02:05:00.962-07:00" -> null
      - healthy_threshold   = 2 -> null
      - id                  = "projects/cq-provider-gcp/global/httpsHealthChecks/cq-health-check" -> null
      - name                = "cq-health-check" -> null
      - port                = 443 -> null
      - project             = "cq-provider-gcp" -> null
      - request_path        = "/" -> null
      - self_link           = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/httpsHealthChecks/cq-health-check" -> null
      - timeout_sec         = 1 -> null
      - unhealthy_threshold = 2 -> null
    }

  # module.test.google_compute_instance.default will be destroyed
  # (because google_compute_instance.default is not in configuration)
  - resource "google_compute_instance" "default" {
      - can_ip_forward       = false -> null
      - cpu_platform         = "Intel Broadwell" -> null
      - current_status       = "RUNNING" -> null
      - deletion_protection  = false -> null
      - enable_display       = false -> null
      - guest_accelerator    = [] -> null
      - id                   = "projects/cq-provider-gcp/zones/us-east1-b/instances/cq-compute" -> null
      - instance_id          = "8208981321110284386" -> null
      - label_fingerprint    = "42WmSpB8rSM=" -> null
      - labels               = {} -> null
      - machine_type         = "e2-micro" -> null
      - metadata             = {} -> null
      - metadata_fingerprint = "zuFR_-HDP94=" -> null
      - name                 = "cq-compute" -> null
      - project              = "cq-provider-gcp" -> null
      - resource_policies    = [] -> null
      - self_link            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/instances/cq-compute" -> null
      - tags                 = [
          - "health-check",
          - "ssh",
        ] -> null
      - tags_fingerprint     = "YE9oAcj-gRw=" -> null
      - zone                 = "us-east1-b" -> null

      - boot_disk {
          - auto_delete = true -> null
          - device_name = "persistent-disk-0" -> null
          - mode        = "READ_WRITE" -> null
          - source      = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/disks/cq-compute" -> null

          - initialize_params {
              - image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20220317" -> null
              - labels = {} -> null
              - size   = 10 -> null
              - type   = "pd-standard" -> null
            }
        }

      - network_interface {
          - name               = "nic0" -> null
          - network            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/default" -> null
          - network_ip         = "10.142.0.2" -> null
          - queue_count        = 0 -> null
          - stack_type         = "IPV4_ONLY" -> null
          - subnetwork         = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/subnetworks/default" -> null
          - subnetwork_project = "cq-provider-gcp" -> null
        }

      - scheduling {
          - automatic_restart   = true -> null
          - min_node_cpus       = 0 -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
          - provisioning_model  = "STANDARD" -> null
        }
    }

  # module.test.google_compute_instance_group.test will be destroyed
  # (because google_compute_instance_group.test is not in configuration)
  - resource "google_compute_instance_group" "test" {
      - description = "Integration test instance group" -> null
      - id          = "projects/cq-provider-gcp/zones/us-east1-b/instanceGroups/cq-instance-group" -> null
      - instances   = [] -> null
      - name        = "cq-instance-group" -> null
      - network     = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - project     = "cq-provider-gcp" -> null
      - self_link   = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/instanceGroups/cq-instance-group" -> null
      - size        = 0 -> null
      - zone        = "us-east1-b" -> null
    }

  # module.test.google_compute_managed_ssl_certificate.gcp_compute_managed_ssl_certificates_cert will be destroyed
  # (because google_compute_managed_ssl_certificate.gcp_compute_managed_ssl_certificates_cert is not in configuration)
  - resource "google_compute_managed_ssl_certificate" "gcp_compute_managed_ssl_certificates_cert" {
      - certificate_id            = 9111095856824684207 -> null
      - creation_timestamp        = "2022-03-24T01:48:00.149-07:00" -> null
      - id                        = "projects/cq-provider-gcp/global/sslCertificates/cq-managed-cert" -> null
      - name                      = "cq-managed-cert" -> null
      - project                   = "cq-provider-gcp" -> null
      - self_link                 = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/sslCertificates/cq-managed-cert" -> null
      - subject_alternative_names = [] -> null
      - type                      = "MANAGED" -> null

      - managed {
          - domains = [
              - "cloudquery.dev",
              - "ex.cloudquery.dev",
            ] -> null
        }
    }

  # module.test.google_compute_router.vpn_router will be destroyed
  # (because google_compute_router.vpn_router is not in configuration)
  - resource "google_compute_router" "vpn_router" {
      - creation_timestamp            = "2022-03-19T09:20:55.706-07:00" -> null
      - encrypted_interconnect_router = false -> null
      - id                            = "projects/cq-provider-gcp/regions/us-east1/routers/cq-us-east1-compute-vpn-router" -> null
      - name                          = "cq-us-east1-compute-vpn-router" -> null
      - network                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - project                       = "cq-provider-gcp" -> null
      - region                        = "us-east1" -> null
      - self_link                     = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/routers/cq-us-east1-compute-vpn-router" -> null

      - bgp {
          - advertise_mode     = "DEFAULT" -> null
          - advertised_groups  = [] -> null
          - asn                = 64519 -> null
          - keepalive_interval = 20 -> null
        }
    }

  # module.test.google_compute_ssl_policy.ssl-policy will be destroyed
  # (because google_compute_ssl_policy.ssl-policy is not in configuration)
  - resource "google_compute_ssl_policy" "ssl-policy" {
      - creation_timestamp = "2022-03-24T01:48:00.065-07:00" -> null
      - custom_features    = [] -> null
      - enabled_features   = [
          - "TLS_ECDHE_ECDSA_WITH_AES_128_CBC_SHA",
          - "TLS_ECDHE_ECDSA_WITH_AES_128_GCM_SHA256",
          - "TLS_ECDHE_ECDSA_WITH_AES_256_CBC_SHA",
          - "TLS_ECDHE_ECDSA_WITH_AES_256_GCM_SHA384",
          - "TLS_ECDHE_ECDSA_WITH_CHACHA20_POLY1305_SHA256",
          - "TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA",
          - "TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256",
          - "TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA",
          - "TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384",
          - "TLS_ECDHE_RSA_WITH_CHACHA20_POLY1305_SHA256",
        ] -> null
      - fingerprint        = "u9v_Oi9pzNo=" -> null
      - id                 = "projects/cq-provider-gcp/global/sslPolicies/cq-ssl-policy" -> null
      - min_tls_version    = "TLS_1_0" -> null
      - name               = "cq-ssl-policy" -> null
      - profile            = "MODERN" -> null
      - project            = "cq-provider-gcp" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/sslPolicies/cq-ssl-policy" -> null
    }

  # module.test.google_compute_target_http_proxy.gcp_compute_target_http_proxies will be destroyed
  # (because google_compute_target_http_proxy.gcp_compute_target_http_proxies is not in configuration)
  - resource "google_compute_target_http_proxy" "gcp_compute_target_http_proxies" {
      - creation_timestamp = "2022-03-24T01:48:33.151-07:00" -> null
      - id                 = "projects/cq-provider-gcp/global/targetHttpProxies/cq-target-http-proxy" -> null
      - name               = "cq-target-http-proxy" -> null
      - project            = "cq-provider-gcp" -> null
      - proxy_bind         = false -> null
      - proxy_id           = 5062167072341069454 -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/targetHttpProxies/cq-target-http-proxy" -> null
      - url_map            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/urlMaps/cq-urlmap" -> null
    }

  # module.test.google_compute_target_https_proxy.gcp_compute_target_https_proxies will be destroyed
  # (because google_compute_target_https_proxy.gcp_compute_target_https_proxies is not in configuration)
  - resource "google_compute_target_https_proxy" "gcp_compute_target_https_proxies" {
      - creation_timestamp = "2022-03-24T01:48:33.217-07:00" -> null
      - id                 = "projects/cq-provider-gcp/global/targetHttpsProxies/cq-target-https-proxy" -> null
      - name               = "cq-target-https-proxy" -> null
      - project            = "cq-provider-gcp" -> null
      - proxy_bind         = false -> null
      - proxy_id           = 7224512174768623246 -> null
      - quic_override      = "NONE" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/targetHttpsProxies/cq-target-https-proxy" -> null
      - ssl_certificates   = [] -> null
      - ssl_policy         = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/sslPolicies/cq-ssl-policy" -> null
      - url_map            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/urlMaps/cq-urlmap" -> null
    }

  # module.test.google_compute_target_ssl_proxy.gcp_compute_target_ssl_proxies_proxy will be destroyed
  # (because google_compute_target_ssl_proxy.gcp_compute_target_ssl_proxies_proxy is not in configuration)
  - resource "google_compute_target_ssl_proxy" "gcp_compute_target_ssl_proxies_proxy" {
      - backend_service    = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-another-backend-service" -> null
      - creation_timestamp = "2022-03-24T01:48:11.373-07:00" -> null
      - id                 = "projects/cq-provider-gcp/global/targetSslProxies/cq-target-ssl-proxy" -> null
      - name               = "cq-target-ssl-proxy" -> null
      - project            = "cq-provider-gcp" -> null
      - proxy_header       = "NONE" -> null
      - proxy_id           = 5081769242950471332 -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/targetSslProxies/cq-target-ssl-proxy" -> null
      - ssl_certificates   = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/sslCertificates/cq-managed-cert",
        ] -> null
    }

  # module.test.google_compute_url_map.external_url_map will be destroyed
  # (because google_compute_url_map.external_url_map is not in configuration)
  - resource "google_compute_url_map" "external_url_map" {
      - creation_timestamp = "2022-03-24T01:48:21.638-07:00" -> null
      - default_service    = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
      - fingerprint        = "VoPr27aXPSw=" -> null
      - id                 = "projects/cq-provider-gcp/global/urlMaps/cq-external-urlmap" -> null
      - map_id             = 8699917386080423610 -> null
      - name               = "cq-external-urlmap" -> null
      - project            = "cq-provider-gcp" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/urlMaps/cq-external-urlmap" -> null

      - host_rule {
          - hosts        = [
              - "ex.cloudquery.dev",
            ] -> null
          - path_matcher = "external-1" -> null
        }

      - path_matcher {
          - default_service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
          - name            = "external-1" -> null

          - path_rule {
              - paths   = [
                  - "/home",
                ] -> null
              - service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
            }
        }
    }

  # module.test.google_compute_url_map.url_map will be destroyed
  # (because google_compute_url_map.url_map is not in configuration)
  - resource "google_compute_url_map" "url_map" {
      - creation_timestamp = "2022-03-24T01:48:21.968-07:00" -> null
      - default_service    = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
      - fingerprint        = "y3FmKMTWx3Y=" -> null
      - id                 = "projects/cq-provider-gcp/global/urlMaps/cq-urlmap" -> null
      - map_id             = 4628571505126641338 -> null
      - name               = "cq-urlmap" -> null
      - project            = "cq-provider-gcp" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/urlMaps/cq-urlmap" -> null

      - host_rule {
          - hosts        = [
              - "beta.cloudquery.dev",
            ] -> null
          - path_matcher = "secondary" -> null
        }
      - host_rule {
          - hosts        = [
              - "cloudquery.dev",
            ] -> null
          - path_matcher = "root" -> null
        }

      - path_matcher {
          - default_service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
          - name            = "root" -> null

          - path_rule {
              - paths = [
                  - "/home",
                ] -> null

              - route_action {

                  - weighted_backend_services {
                      - backend_service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
                      - weight          = 400 -> null

                      - header_action {
                          - request_headers_to_remove  = [
                              - "RequestHeaderToRemove",
                            ] -> null
                          - response_headers_to_remove = [
                              - "ResponseHeaderToRemove",
                            ] -> null

                          - request_headers_to_add {
                              - header_name  = "RequestHeaderToAdd" -> null
                              - header_value = "RequestHeaderToAddValue" -> null
                              - replace      = true -> null
                            }

                          - response_headers_to_add {
                              - header_name  = "ResponseHeaderToAdd" -> null
                              - header_value = "ResponseHeaderToAddValue" -> null
                              - replace      = false -> null
                            }
                        }
                    }
                }
            }
          - path_rule {
              - paths   = [
                  - "/login",
                ] -> null
              - service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
            }
          - path_rule {
              - paths   = [
                  - "/static",
                ] -> null
              - service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
            }
        }
      - path_matcher {
          - default_service = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
          - name            = "secondary" -> null
        }

      - test {
          - host    = "beta.cloudquery.dev" -> null
          - path    = "/healthcheck" -> null
          - service = "https://compute.googleapis.com/compute/v1/projects/cq-provider-gcp/global/backendServices/cq-internal-backend-service" -> null
        }
    }

  # module.test.google_service_account.example will be created
  + resource "google_service_account" "example" {
      + account_id   = "cq-example-gke-service-account"
      + disabled     = false
      + display_name = "cq-example-gke-service-account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cq-provider-gcp"
      + unique_id    = (known after apply)
    }

  # module.test.module.gke.data.google_compute_subnetwork.gke_subnetwork[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_subnetwork" "gke_subnetwork" {
      + description              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = (known after apply)
      + name                     = (known after apply)
      + network                  = (known after apply)
      + private_ip_google_access = (known after apply)
      + project                  = "cq-provider-gcp"
      + region                   = "us-east1"
      + secondary_ip_range       = (known after apply)
      + self_link                = (known after apply)
    }

  # module.test.module.gke.google_compute_firewall.intra_egress[0] will be created
  + resource "google_compute_firewall" "intra_egress" {
      + creation_timestamp = (known after apply)
      + description        = "Managed by terraform gke module: Allow pods to communicate with each other and the master"
      + destination_ranges = (known after apply)
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-cq-example-gke-cluster-intra-cluster-egress"
      + network            = "cq-example-gke-cluster-network"
      + priority           = 1000
      + project            = "cq-provider-gcp"
      + self_link          = (known after apply)
      + target_tags        = [
          + "gke-cq-example-gke-cluster",
        ]

      + allow {
          + ports    = []
          + protocol = "ah"
        }
      + allow {
          + ports    = []
          + protocol = "esp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
      + allow {
          + ports    = []
          + protocol = "sctp"
        }
      + allow {
          + ports    = []
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # module.test.module.gke.google_compute_firewall.master_webhooks[0] will be created
  + resource "google_compute_firewall" "master_webhooks" {
      + creation_timestamp = (known after apply)
      + description        = "Managed by terraform gke module: Allow master to hit pods for admission controllers/webhooks"
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-cq-example-gke-cluster-webhooks"
      + network            = "cq-example-gke-cluster-network"
      + priority           = 1000
      + project            = "cq-provider-gcp"
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "gke-cq-example-gke-cluster",
        ]

      + allow {
          + ports    = [
              + "9443",
              + "15017",
            ]
          + protocol = "tcp"
        }
    }

  # module.test.module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + label_fingerprint           = (known after apply)
      + location                    = "us-east1"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + min_master_version          = "1.23.6-gke.1500"
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "cq-example-gke-cluster"
      + network                     = "projects/cq-provider-gcp/global/networks/cq-example-gke-cluster-network"
      + networking_mode             = (known after apply)
      + node_locations              = [
          + "us-east1-c",
        ]
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "cq-provider-gcp"
      + remove_default_node_pool    = false
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = false
            }

          + horizontal_pod_autoscaling {
              + disabled = false
            }

          + http_load_balancing {
              + disabled = true
            }

          + network_policy_config {
              + disabled = true
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = false

          + auto_provisioning_defaults {
              + image_type      = (known after apply)
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + state = "DECRYPTED"
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "cq-example-gke-cluster-ip-range-pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "cq-example-gke-cluster-ip-range-svc"
        }

      + logging_config {
          + enable_components = (known after apply)
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + monitoring_config {
          + enable_components = (known after apply)
        }

      + network_policy {
          + enabled = false
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + node_group        = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + gcfs_config {
              + enabled = (known after apply)
            }

          + gvnic {
              + enabled = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count          = 0
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = "default-pool"
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = "COS_CONTAINERD"
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = "e2-micro"
              + metadata          = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = false
              + service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com"
              + tags              = [
                  + "gke-cq-example-gke-cluster",
                  + "gke-cq-example-gke-cluster-default-pool",
                ]
              + taint             = (known after apply)

              + gcfs_config {
                  + enabled = false
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }

              + workload_metadata_config {
                  + mode = "GKE_METADATA"
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + vertical_pod_autoscaling {
          + enabled = false
        }

      + workload_identity_config {
          + workload_pool = "cq-provider-gcp.svc.id.goog"
        }
    }

  # module.test.module.gke.google_container_node_pool.pools["cq-example-gke-pool-1"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster                     = "cq-example-gke-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "cq-example-gke-pool-1"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "cq-provider-gcp"
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 1
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 10
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS_CONTAINERD"
          + labels            = {
              + "cluster_name" = "cq-example-gke-cluster"
              + "node_pool"    = "cq-example-gke-pool-1"
            }
          + local_ssd_count   = 0
          + machine_type      = "e2-micro"
          + metadata          = {
              + "cluster_name"             = "cq-example-gke-cluster"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "cq-example-gke-pool-1"
            }
          + oauth_scopes      = (known after apply)
          + preemptible       = true
          + service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com"
          + tags              = [
              + "gke-cq-example-gke-cluster",
              + "gke-cq-example-gke-cluster-cq-example-gke-pool-1",
            ]
          + taint             = (known after apply)

          + gcfs_config {
              + enabled = false
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.test.module.gke.google_container_node_pool.pools["default-node-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster                     = "cq-example-gke-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "default-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = [
          + "us-east1-b",
          + "us-east1-c",
        ]
      + operation                   = (known after apply)
      + project                     = "cq-provider-gcp"
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 2
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 10
          + disk_type         = "pd-standard"
          + guest_accelerator = []
          + image_type        = "COS_CONTAINERD"
          + labels            = {
              + "cluster_name"      = "cq-example-gke-cluster"
              + "default-node-pool" = "true"
              + "node_pool"         = "default-node-pool"
            }
          + local_ssd_count   = 0
          + machine_type      = "e2-micro"
          + metadata          = {
              + "cluster_name"                    = "cq-example-gke-cluster"
              + "disable-legacy-endpoints"        = "true"
              + "node-pool-metadata-custom-value" = "my-node-pool"
              + "node_pool"                       = "default-node-pool"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com"
          + tags              = [
              + "gke-cq-example-gke-cluster",
              + "gke-cq-example-gke-cluster-default-node-pool",
              + "default-node-pool",
            ]
          + taint             = [
              + {
                  + effect = "PREFER_NO_SCHEDULE"
                  + key    = "default-node-pool"
                  + value  = "true"
                },
            ]

          + gcfs_config {
              + enabled = false
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-log_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cq-provider-gcp"
      + role    = "roles/logging.logWriter"
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-metric_writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cq-provider-gcp"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cq-provider-gcp"
      + role    = "roles/monitoring.viewer"
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be created
  + resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cq-provider-gcp"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.test.module.gke.google_service_account.cluster_service_account[0] will be created
  + resource "google_service_account" "cluster_service_account" {
      + account_id   = (known after apply)
      + disabled     = false
      + display_name = "Terraform-managed service account for cluster cq-example-gke-cluster"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cq-provider-gcp"
      + unique_id    = (known after apply)
    }

  # module.test.module.gke.random_shuffle.available_zones will be created
  + resource "random_shuffle" "available_zones" {
      + id           = (known after apply)
      + input        = [
          + "us-east1-b",
          + "us-east1-c",
          + "us-east1-d",
        ]
      + result       = (known after apply)
      + result_count = 3
    }

  # module.test.module.gke.random_string.cluster_service_account_suffix will be created
  + resource "random_string" "cluster_service_account_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.test.module.vpn-manage-internal.google_compute_address.vpn_gw_ip will be destroyed
  # (because google_compute_address.vpn_gw_ip is not in configuration)
  - resource "google_compute_address" "vpn_gw_ip" {
      - address            = "34.73.220.58" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2022-03-19T09:20:33.491-07:00" -> null
      - id                 = "projects/cq-provider-gcp/regions/us-east1/addresses/ip-cq-compute" -> null
      - name               = "ip-cq-compute" -> null
      - network_tier       = "PREMIUM" -> null
      - prefix_length      = 0 -> null
      - project            = "cq-provider-gcp" -> null
      - region             = "us-east1" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/addresses/ip-cq-compute" -> null
      - users              = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-esp",
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp4500",
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp500",
        ] -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_esp will be destroyed
  # (because google_compute_forwarding_rule.vpn_esp is not in configuration)
  - resource "google_compute_forwarding_rule" "vpn_esp" {
      - all_ports              = false -> null
      - allow_global_access    = false -> null
      - creation_timestamp     = "2022-03-19T09:21:07.330-07:00" -> null
      - id                     = "projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-esp" -> null
      - ip_address             = "34.73.220.58" -> null
      - ip_protocol            = "ESP" -> null
      - is_mirroring_collector = false -> null
      - label_fingerprint      = "42WmSpB8rSM=" -> null
      - labels                 = {} -> null
      - load_balancing_scheme  = "EXTERNAL" -> null
      - name                   = "cq-compute-esp" -> null
      - network_tier           = "PREMIUM" -> null
      - ports                  = [] -> null
      - project                = "cq-provider-gcp" -> null
      - region                 = "us-east1" -> null
      - self_link              = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-esp" -> null
      - target                 = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp4500 will be destroyed
  # (because google_compute_forwarding_rule.vpn_udp4500 is not in configuration)
  - resource "google_compute_forwarding_rule" "vpn_udp4500" {
      - all_ports              = false -> null
      - allow_global_access    = false -> null
      - creation_timestamp     = "2022-03-19T09:21:07.602-07:00" -> null
      - id                     = "projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp4500" -> null
      - ip_address             = "34.73.220.58" -> null
      - ip_protocol            = "UDP" -> null
      - is_mirroring_collector = false -> null
      - label_fingerprint      = "42WmSpB8rSM=" -> null
      - labels                 = {} -> null
      - load_balancing_scheme  = "EXTERNAL" -> null
      - name                   = "cq-compute-udp4500" -> null
      - network_tier           = "PREMIUM" -> null
      - port_range             = "4500" -> null
      - ports                  = [] -> null
      - project                = "cq-provider-gcp" -> null
      - region                 = "us-east1" -> null
      - self_link              = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp4500" -> null
      - target                 = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp500 will be destroyed
  # (because google_compute_forwarding_rule.vpn_udp500 is not in configuration)
  - resource "google_compute_forwarding_rule" "vpn_udp500" {
      - all_ports              = false -> null
      - allow_global_access    = false -> null
      - creation_timestamp     = "2022-03-19T09:21:07.691-07:00" -> null
      - id                     = "projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp500" -> null
      - ip_address             = "34.73.220.58" -> null
      - ip_protocol            = "UDP" -> null
      - is_mirroring_collector = false -> null
      - label_fingerprint      = "42WmSpB8rSM=" -> null
      - labels                 = {} -> null
      - load_balancing_scheme  = "EXTERNAL" -> null
      - name                   = "cq-compute-udp500" -> null
      - network_tier           = "PREMIUM" -> null
      - port_range             = "500" -> null
      - ports                  = [] -> null
      - project                = "cq-provider-gcp" -> null
      - region                 = "us-east1" -> null
      - self_link              = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/forwardingRules/cq-compute-udp500" -> null
      - target                 = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_route.route[0] will be destroyed
  # (because google_compute_route.route is not in configuration)
  - resource "google_compute_route" "route" {
      - dest_range          = "10.10.12.0/24" -> null
      - id                  = "projects/cq-provider-gcp/global/routes/cq-compute-tunnel1-route1" -> null
      - name                = "cq-compute-tunnel1-route1" -> null
      - network             = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - next_hop_vpn_tunnel = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/vpnTunnels/cq-compute-tunnel-1" -> null
      - priority            = 1000 -> null
      - project             = "cq-provider-gcp" -> null
      - self_link           = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/routes/cq-compute-tunnel1-route1" -> null
      - tags                = [] -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_vpn_gateway.vpn_gateway will be destroyed
  # (because google_compute_vpn_gateway.vpn_gateway is not in configuration)
  - resource "google_compute_vpn_gateway" "vpn_gateway" {
      - creation_timestamp = "2022-03-19T09:20:55.718-07:00" -> null
      - gateway_id         = 4767312044143393800 -> null
      - id                 = "projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
      - name               = "cq-compute" -> null
      - network            = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - project            = "cq-provider-gcp" -> null
      - region             = "us-east1" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_vpn_tunnel.tunnel-static[0] will be destroyed
  # (because google_compute_vpn_tunnel.tunnel-static is not in configuration)
  - resource "google_compute_vpn_tunnel" "tunnel-static" {
      - creation_timestamp              = "2022-03-19T09:21:15.911-07:00" -> null
      - detailed_status                 = "No incoming packets from peer" -> null
      - id                              = "projects/cq-provider-gcp/regions/us-east1/vpnTunnels/cq-compute-tunnel-1" -> null
      - ike_version                     = 2 -> null
      - local_traffic_selector          = [
          - "0.0.0.0/0",
        ] -> null
      - name                            = "cq-compute-tunnel-1" -> null
      - peer_external_gateway_interface = 0 -> null
      - peer_ip                         = "1.1.1.1" -> null
      - project                         = "cq-provider-gcp" -> null
      - region                          = "us-east1" -> null
      - remote_traffic_selector         = [
          - "0.0.0.0/0",
        ] -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/vpnTunnels/cq-compute-tunnel-1" -> null
      - shared_secret                   = (sensitive value)
      - shared_secret_hash              = "AM6Pi-Gtde6lilmMNsJewSFMDf6P" -> null
      - target_vpn_gateway              = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/targetVpnGateways/cq-compute" -> null
      - tunnel_id                       = "1816642328943377428" -> null
      - vpn_gateway_interface           = 0 -> null
    }

  # module.test.module.vpn-manage-internal.random_id.ipsec_secret will be destroyed
  # (because random_id.ipsec_secret is not in configuration)
  - resource "random_id" "ipsec_secret" {
      - b64_std     = "fUXC0wWuTHs=" -> null
      - b64_url     = "fUXC0wWuTHs" -> null
      - byte_length = 8 -> null
      - dec         = "9026835239723224187" -> null
      - hex         = "7d45c2d305ae4c7b" -> null
      - id          = "fUXC0wWuTHs" -> null
    }

  # module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-master-subnet"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.60.0.0/17"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "cq-example-gke-cluster-master-subnet"
      + network                    = "cq-example-gke-cluster-network"
      + private_ip_google_access   = false
      + private_ipv6_google_access = (known after apply)
      + project                    = "cq-provider-gcp"
      + purpose                    = (known after apply)
      + region                     = "us-east1"
      + secondary_ip_range         = []
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-subnet"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.0.0.0/17"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "cq-example-gke-cluster-subnet"
      + network                    = "cq-example-gke-cluster-network"
      + private_ip_google_access   = false
      + private_ipv6_google_access = (known after apply)
      + project                    = "cq-provider-gcp"
      + purpose                    = (known after apply)
      + region                     = "us-east1"
      + secondary_ip_range         = [
          + {
              + ip_cidr_range = "192.168.0.0/18"
              + range_name    = "cq-example-gke-cluster-ip-range-pods"
            },
          + {
              + ip_cidr_range = "192.168.64.0/18"
              + range_name    = "cq-example-gke-cluster-ip-range-svc"
            },
        ]
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.test.module.gcp-network.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "cq-example-gke-cluster-network"
      + project                         = "cq-provider-gcp"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.test.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-compute-subnet-01"] will be destroyed
  # (because google_compute_subnetwork.subnetwork is not in configuration)
  - resource "google_compute_subnetwork" "subnetwork" {
      - creation_timestamp         = "2022-03-19T09:24:43.116-07:00" -> null
      - gateway_address            = "10.10.20.1" -> null
      - id                         = "projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-compute-subnet-01" -> null
      - ip_cidr_range              = "10.10.20.0/24" -> null
      - name                       = "cq-compute-subnet-01" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - private_ip_google_access   = false -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "cq-provider-gcp" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "us-east1" -> null
      - secondary_ip_range         = [] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-compute-subnet-01" -> null
      - stack_type                 = "IPV4_ONLY" -> null
    }

  # module.test.module.vpc.module.vpc.google_compute_network.network will be destroyed
  # (because google_compute_network.network is not in configuration)
  - resource "google_compute_network" "network" {
      - auto_create_subnetworks         = false -> null
      - delete_default_routes_on_create = false -> null
      - description                     = "Private network for cq-provider-gcp/compute" -> null
      - id                              = "projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
      - mtu                             = 0 -> null
      - name                            = "cq-compute-vpc" -> null
      - project                         = "cq-provider-gcp" -> null
      - routing_mode                    = "GLOBAL" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-compute-vpc" -> null
    }

Plan: 16 to add, 0 to change, 24 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @erezrokah, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*